
&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрТЧ(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	Номенклатура = СтрокаТЧ.Услуга;
	Дата = ТекущаяДата();
	СтрокаТЧ.Количество = 0;
	Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
		Если СтрокаТЧ.Количество >= 0 Тогда
			СтрокаТЧ.Цена = РаботаСЦенами.ЦенаНаДатуПродажи(Номенклатура, Дата);
		Иначе
			Сообщить("Количество должно быть больше ноля!");
			СтрокаТЧ.Количество = 0;
			СтрокаТЧ.Цена = 0;
		КонецЕсли;
	КонецЕсли;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрТЧ(СтрокаТЧ);
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
    Если НЕ РольДоступна("ПолныеПрава") Тогда
        Элементы.УслугаОказана.ТолькоПросмотр = Истина;
    КонецЕсли;        
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Если Параметры.Свойство("Начало") Тогда 
			Объект.ДатаЗаписи = Параметры.Начало;
		КонецЕсли;
		Если Параметры.Свойство("Окончание") Тогда
			Объект.ДатаОкончанияЗаписи = Параметры.Окончание;
		КонецЕсли;
		Если Параметры.Свойство("Сотрудник") Тогда
			Объект.Сотрудник = Параметры.Сотрудник;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ДатаЗаписи) Тогда
			Объект.Дата = НачалоДня(Объект.ДатаЗаписи);
		КонецЕсли;    
	КонецЕсли;
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Записан заказ");
КонецПроцедуры

