&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрТЧ(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	СтрокаТЧ.ТипНоменклатуры = ПолучитьТипНоменклатуры(СтрокаТЧ.Номенклатура);
	УчётнаяПолитика = ПолучитьУчётнуюПолитику();
	СтрокаТЧ.СрокГодности = ?(УчётнаяПолитика = ПредопределенноеЗначение("Перечисление.ВидыУчётнойПолитики.FIFO"),
	ТекущаяДата() + СлучайноеЧисло(),
	"00010101");
	Дата = ТекущаяДата();
	СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПоКонтрагенту(СтрокаТЧ.Номенклатура, Объект.Поставщик, Дата); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипНоменклатуры(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Наименование = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура.Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ТипНоменклатуры;
КонецФункции

&НаСервере
Функция СлучайноеЧисло() Экспорт
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	СлучайноеЧисло = ГСЧ.СлучайноеЧисло(0, 16777216);
	Возврат СлучайноеЧисло;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УчётнаяПолитика = ПолучитьУчётнуюПолитику();
	Элементы.ТоварыСрокГодности.Видимость = ?(УчётнаяПолитика = ПредопределенноеЗначение("Перечисление.ВидыУчётнойПолитики.FIFO"),
	Истина,
	Ложь);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьУчётнуюПолитику()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчётнаяПолитикаСрезПоследних.УчётнаяПолитика КАК УчётнаяПолитика
	               |ИЗ
	               |	РегистрСведений.УчётнаяПолитика.СрезПоследних КАК УчётнаяПолитикаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.УчётнаяПолитика;
КонецФункции

&НаСервере
Функция ПолучитьЦеныДляОбновления(ТекДата, Поставщик, Ссылка)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровТовары.НомерСтроки КАК НомерСтроки,
	               |	ПоступлениеТоваровТовары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_Номенклатура
	               |ИЗ
	               |	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	               |ГДЕ
	               |	ПоступлениеТоваровТовары.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Номенклатура.НомерСтроки КАК НомерСтроки,
	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(&Период, &Поставщик = Поставщик) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
	               |		ПО ВТ_Номенклатура.Номенклатура = ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура"
					;

	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Период", ТекДата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивДляВозврата = Новый Массив();
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивДляВозврата.Добавить(Выборка.НомерСтроки);
			МассивДляВозврата.Добавить(Выборка.Цена);	
		КонецЦикла;
		Возврат МассивДляВозврата;
	КонецЕсли;
	
КонецФункции                  

&НаКлиенте
Процедура ОбновитьЦеныТЧ(Команда)
	СтрокаЦена = Новый Массив();
	СтрокаЦена = ПолучитьЦеныДляОбновления(Объект.Дата, Объект.Поставщик, Объект.Ссылка); 
	Счетчик = 0;
	Для Каждого Элемент Из Объект.Товары Цикл
		Если Элемент.НомерСтроки = СтрокаЦена[Счетчик]
			И СтрокаЦена[Счетчик + 1] <> 0 Тогда
			Элемент.Цена = СтрокаЦена[Счетчик + 1];
			Счетчик = Счетчик + 2;
		КонецЕсли;                            
	КонецЦикла;                    
КонецПроцедуры
