&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Поставщик") Тогда
		Элементы.Наименование.Заголовок = "Наименование поставщика";
		Элементы.ОсновнойДоговор.Видимость = Истина;
		Элементы.ИнформацияОПитомце.Видимость = Ложь;
		Элементы.ДатаРождения.Видимость = Ложь;
		Элементы.ИсточникИнформации.Видимость = Ложь;
		Элементы.Пол.Видимость = Ложь;
	Иначе
		Элементы.Наименование.Заголовок = "Ф.И.О. клиента";
		Элементы.ИнформацияОПитомце.Видимость = Истина;
		Элементы.ДатаРождения.Видимость = Истина;
		Элементы.ИсточникИнформации.Видимость = Истина;
		Элементы.Пол.Видимость = Истина;
		Элементы.ОсновнойДоговор.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

