
Процедура ПолучитьПодтверждениеРегистрацииКлиентаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадача.Наименование  = СтрШаблон("Получить солгасие клиента %1 на регистрацию", Клиент.Наименование);
		ФормируемаяЗадача.Предмет = Клиент.Ссылка;
		ФормируемаяЗадача.ОписаниеЗадачи = СтрШаблон("Из мобильного приложения поступила заявка на регистрацию пользователя %1. Необходимо созвониться с клиентом по телефону %2",
			Клиент.Наименование,
			"8 (999) 001-11-11");
		//Это костыль, что бы работало отображение задач по пользователю.	
		//ФормируемаяЗадача.Исполнитель = ПараметрыСеанса.ТекущийПользователь; 
	КонецЦикла;
КонецПроцедуры

Процедура КлиентПодтвердилРегистрациюПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = РегистрацияПодтверждена; 	
КонецПроцедуры

Процедура ПометкаНаУдалениеПользователяОбработка(ТочкаМаршрутаБизнесПроцесса)
	ЗаблокироватьДанныеДляРедактирования(Клиент);
	Объект = Клиент.ПолучитьОбъект();
	Объект.УстановитьПометкуУдаления(Истина);
	Объект.Записать();
	РазблокироватьДанныеДляРедактирования(Клиент);
КонецПроцедуры
