
&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.Бессрочный Тогда
		Элементы.ДатаОкончания.Видимость = Ложь;
	Иначе
		Элементы.ДатаОкончания.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИмяДоговора()
	Дата = 	Формат(Объект.ДатаЗаключения, "ДЛФ=ДД");
	Если ЗначениеЗаполнено(Объект.НомерДоговора) И
		ЗначениеЗаполнено(Объект.ДатаЗаключения) Тогда
		Объект.Наименование = "№" + Объект.НомерДоговора + " от " + Дата;
	ИначеЕсли ЗначениеЗаполнено(Объект.НомерДоговора) И
		НЕ ЗначениеЗаполнено(Объект.ДатаЗаключения) Тогда
		Объект.Наименование = "№" + Объект.НомерДоговора;
	Иначе
		Объект.Наименование = "от " +  Дата;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	СформироватьИмяДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьИмяДоговора();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаключенияПриИзменении(Элемент)
	СформироватьИмяДоговора();
КонецПроцедуры
