&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаНачалаДействияЦены = НачалоДня(ТекущаяДата());
	Номенклатура = Параметры.Номенклатура;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()           
	ЦеныНоменклатуры = РегистрыСведений.Цены;
	НаборЗаписей = ЦеныНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	НаборЗаписей.Отбор.ТипЦены.Установить(ВидЦены);
	НаборЗаписей.Отбор.Период.Установить(ДатаНачалаДействияЦены);

	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() Тогда
	    НаборЗаписей[0].Цена = Цена;
	Иначе
	    НоваяЗаписьЦен = НаборЗаписей.Добавить();
	    НоваяЗаписьЦен.Номенклатура = Номенклатура;
	    НоваяЗаписьЦен.ТипЦены = ВидЦены;
	    НоваяЗаписьЦен.Период = ДатаНачалаДействияЦены;
	    НоваяЗаписьЦен.Цена = Цена;
	КонецЕсли;
	НаборЗаписей.Записать();
		
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЦенаНаДату = РаботаСЦенами.ПолучитьЦенуНаКонкретнуюДату(Номенклатура, ВидЦены, ДатаНачалаДействияЦены); 
	Если ЗначениеЗаполнено(ЦенаНаДату) Тогда        
		ТекстВопроса = СтрШаблон("На указанную дату уже имеется введенная цена %1, вы действительно хотите изменить цену?", ЦенаНаДату);
		ОбратныйВызов = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииЦены", ЭтаФорма);        
		ПоказатьВопрос(ОбратныйВызов, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");    
	Иначе
		ЗаписатьНаСервере();
		Закрыть();
 	КонецЕсли;
КонецПроцедуры       


&НаСервере
Процедура ПриОткрытииНаСервере()
	ДатаНачалаДействияЦены = НачалоДня(ТекущаяДата());
	Номенклатура = Параметры.Номенклатура;
КонецПроцедуры
