
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ТоварыНаСкладах Приход
	Движения.ТоварыНаСкладах.Записывать = Истина;
	//Переделать с блокировкой и нормальным запросом.
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		//Иначе теряем сроки годности при переносе со склада на склад. Необходимо убрать запрос из цикла.
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности
		               |ИЗ
		               |	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки";
		Запрос.УстановитьПараметр("Номенклатура", ТекСтрокаТовары.Товар);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			СрокГодности = Выборка.СрокГодности;
		Иначе
			//На начало месяца не было данной номенклатуры, т.е. срок годности == ""
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности
			               |ИЗ
			               |	РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментИтогов, Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки";
			Запрос.УстановитьПараметр("Номенклатура", ТекСтрокаТовары.Товар);
			Запрос.УстановитьПараметр("МоментИтогов", Новый Граница(МоментВремени()));
			
			Выборка = Запрос.Выполнить().Выбрать();
			Выборка.Следующий();
			СрокГодности = Выборка.СрокГодности;
		КонецЕсли;
		
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Товар;
		Движение.Склад = СкладПолучатель;
		Движение.Количество = ТекСтрокаТовары.Количетсво;
		Движение.СрокГодности = СрокГодности;

		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Товар;
		Движение.Склад = СкладОтправитель;
		Движение.Количество = ТекСтрокаТовары.Количетсво;
		Движение.СрокГодности = СрокГодности;
	КонецЦикла;
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(АвторДокумента) Тогда
		АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

