
&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СтатьяЗатрат) Тогда
		СтрокаТЧ.СтатьяЗатрат = ПолучитьСтатьюРасходовПоНоменклатуре(СтрокаТЧ.Номенклатура);
	КонецЕсли;
	Дата = ТекущаяДата();
	СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПоКонтрагенту(СтрокаТЧ.Номенклатура, Объект.Поставщик, Дата);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатьюРасходовПоНоменклатуре(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Наименование = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура.Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.СтатьяЗатрат;
КонецФункции

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрТЧ(СтрокаТЧ);
КонецПроцедуры

&НаСервере
Функция ПолучитьЦеныДляОбновления(ТекДата, Поставщик, Ссылка)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеУслугУслуги.НомерСтроки КАК НомерСтроки,
	               |	ПоступлениеУслугУслуги.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_Номенклатура
	               |ИЗ
	               |	Документ.ПоступлениеУслуг.Услуги КАК ПоступлениеУслугУслуги
	               |ГДЕ
	               |	ПоступлениеУслугУслуги.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦеныНоменклатурыПоставщиковСрезПоследних.Цена КАК Цена,
	               |	ВТ_Номенклатура.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(&Период, &Поставщик = Поставщик) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
	               |		ПО ВТ_Номенклатура.Номенклатура = ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура"
					;

	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Период", ТекДата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивДляВозврата = Новый Массив();
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивДляВозврата.Добавить(Выборка.НомерСтроки);
			МассивДляВозврата.Добавить(Выборка.Цена);	
		КонецЦикла;
		Возврат МассивДляВозврата;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЦеныТЧ(Команда)
	//Здесь неявный запрос в цикле
	//Для Каждого Элемент Из Объект.Услуги Цикл
	//	Цена = РаботаСЦенами.ПолучитьЦенуПоКонтрагенту(Элемент.Номенклатура, Объект.Поставщик, Объект.Дата);	
	//	Если Цена = 0 Тогда
	//		Продолжить;	
	//	КонецЕсли;
	//	Элемент.Цена = Цена;
	//КонецЦикла;	
	СтрокаЦена = Новый Массив();
	СтрокаЦена = ПолучитьЦеныДляОбновления(Объект.Дата, Объект.Поставщик, Объект.Ссылка); 
	Счетчик = 0;
	Для Каждого Элемент Из Объект.Услуги Цикл
		Если Элемент.НомерСтроки = СтрокаЦена[Счетчик]
			И СтрокаЦена[Счетчик + 1] <> 0 Тогда
			Элемент.Цена = СтрокаЦена[Счетчик + 1];
			Счетчик = Счетчик + 2;
		КонецЕсли;                            
	КонецЦикла;
КонецПроцедуры



